УРВ_файловая/src/InformationRegisters/НаличиеОбновленийОбращений/НаличиеОбновленийОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаличиеОбновленийОбращений</name>
  <resources>
    <name>ЕстьОбновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.Обращение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/НаличиеОбновленийОбращений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр по переданным параметрам.
//
// Параметры:
//  Обращение      - ДокументСсылка.Обращение - 
//  ЕстьОбновление - Булево - признак наличия обновления 
//
Процедура ДобавитьЗапись(Обращение, ЕстьОбновление) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.НаличиеОбновленийОбращений.СоздатьМенеджерЗаписи();
	Менеджер.Обращение = Обращение;
	Менеджер.ЕстьОбновление = ЕстьОбновление;
	Менеджер.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
